JustRight/app/controllers/api/v1/appointments_controller.rb

SELECT "appointments".* FROM "appointments"
---
  def index
    appointments = Appointment.all

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    appointment = Appointment.find_by(id: params[:id])