JustRight/app/controllers/api/v1/experiences_controller.rb

SELECT "experiences".* FROM "experiences"
---
  def index
    experiences = Experience.all

SELECT "experiences".* FROM "experiences" WHERE "experiences"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
---
  def show
    experience = Experience.find_by(id: params[:id])