JustRight/app/controllers/api/v1/job_posts_controller.rb

SELECT "job_posts".* FROM "job_posts"
---
  def index
    jobposts = JobPost.all