JustRight/app/controllers/api/v1/offers_controller.rb

SELECT "offers".* FROM "offers"
---
  def index
    offers = Offer.all

SELECT "offers".* FROM "offers" WHERE "offers"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def show
    offer = Offer.find_by(id: params[:id])