JustRight/app/controllers/api/v1/users_controller.rb

def create
    user = User.new(user_params)
     if user.valid?
        user.save
---
INSERT INTO "users" ("username", "password_digest", "address", "phone", "first_name", "last_name", "gender", "age", "email", "image", "client", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"